Revit 2027 API
BuiltInFailures.EditingFailures.CannotCheckoutWorksets Property
 Can't make workset editable. User '[Borrowers]' has already checked it out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCheckoutWorksets { get; }
Public Shared ReadOnly Property CannotCheckoutWorksets As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCheckoutWorksets {
	FailureDefinitionId^ get ();
}
static member CannotCheckoutWorksets : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace